---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.MomentOfInertiaWeakAxis
source: html/5126a827-c6a9-5dc0-64eb-a56585732fe9.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.MomentOfInertiaWeakAxis Property

Moment of Inertia about main weak axis (I).

## Syntax (C#)
```csharp
public double MomentOfInertiaWeakAxis { get; set; }
```